{
    "contents": [
        {
            "id": 1,
            "title": "Fate/Stay Night",
            "description": "One night, years after Kiritsugu's death, Shirou is cleaning at school, when he finds himself caught in the middle of a deadly encounter between two superhumans known as Servants. During his attempt to escape, the boy is caught by one of the Servants and receives a life-threatening injury. Miraculously, he survives, but the same Servant returns to finish what he started. In desperation, Shirou summons a Servant of his own, a knight named Saber. The two must now participate in the Fifth Holy Grail War, a battle royale of seven Servants and the mages who summoned them, with the grand prize being none other than the omnipotent Holy Grail itself.",
            "thumb": "fate-stay-night.jpg",
            "video": "https://",
            "type": "series",
            "viewed": 9919,
            "totalEpisodes": 24,
            "releaseYear": "2010"
        },
        {
            "id": 2,
            "title": "Fate/Zero",
            "description": "With the promise of granting any wish, the omnipotent Holy Grail triggered three wars in the past, each too cruel and fierce to leave a victor. In spite of that, the wealthy Einzbern family is confident that the Fourth Holy Grail War will be different; namely, with a vessel of the Holy Grail now in their grasp. Solely for this reason, the much hated 'Magus Killer' Kiritsugu Emiya is hired by the Einzberns, with marriage to their only daughter Irisviel as binding contract.",
            "thumb": "fate-zero.jpg",
            "video": "https://",
            "type": "series",
            "viewed": 8710,
            "totalEpisodes": 13,
            "releaseYear": "2011"
        },
        {
            "id": 3,
            "title": "Fate/Zero 2nd Season",
            "description": "As the Fourth Holy Grail War rages on with no clear victor in sight, the remaining Servants and their Masters are called upon by Church supervisor Risei Kotomine, in order to band together and confront an impending threat that could unravel the Grail War and bring about the destruction of Fuyuki City. The uneasy truce soon collapses as Masters demonstrate that they will do anything in their power, no matter how despicable, to win.",
            "thumb": "fate-zero-2nd.jpg",
            "video": "https://",
            "type": "series",
            "viewed": 7775,
            "totalEpisodes": 12,
            "releaseYear": "2012"
        },
        {
            "id": 4,
            "title": "Fate/Stay Night: Unlimited Blade Works",
            "description": "The Holy Grail War is a battle royale among seven magi who serve as Masters. Masters, through the use of the command seals they are given when they enter the war, command Heroic Spirits known as Servants to fight for them in battle. In the Fifth Holy Grail War, Rin Toosaka is among the magi entering the competition. With her Servant, Archer, she hopes to obtain the ultimate prize—the Holy Grail, a magical artifact capable of granting its wielder any wish.",
            "thumb": "fate-stay-night-unlimited-blade-works.jpg",
            "video": "https://",
            "type": "series",
            "viewed": 8110,
            "totalEpisodes": 12,
            "releaseYear": "2014"
        },
        {
            "id": 5,
            "title": "Fate/Stay Night Movie: Heaven's Feel - I. Presage Flower",
            "description": "The Holy Grail War: a violent battle between mages in which seven masters and their summoned servants fight for the Holy Grail, a magical artifact that can grant the victor any wish. Nearly 10 years ago, the final battle of the Fourth Holy Grail War wreaked havoc on Fuyuki City and took over 500 lives, leaving the city devastated.",
            "thumb": "fate-stay-night-heavens-feel.png",
            "video": "https://",
            "type": "movie",
            "viewed": 6412,
            "totalEpisodes": 1,
            "releaseYear": "2017"
        },
        {
            "id": 6,
            "title": "Fate/stay night Movie: Heaven's Feel - II. Lost Butterfly",
            "description": "The Fifth Holy Grail War continues, and the ensuing chaos results in higher stakes for all participants. Shirou Emiya continues to participate in the war, aspiring to be a hero of justice who saves everyone. He sets out in search of the truth behind a mysterious dark shadow and its murder spree, determined to defeat it.",
            "thumb": "fate-stay-night-heavens-feel-two.jpg",
            "video": "https://",
            "type": "movie",
            "viewed": 3340,
            "totalEpisodes": 1,
            "releaseYear": "2019"
        },
        {
            "id": 7,
            "title": "Fate/stay night Movie: Heaven's Feel - III. Spring Song",
            "description": "Final of three movies in an adaption of the third route of Fate/stay night.",
            "thumb": "fate-stay-night-heavens-feel-three.jpg",
            "video": "https://",
            "type": "movie",
            "viewed": 2242,
            "totalEpisodes": 1,
            "releaseYear": "2020"
        },
        {
            "id": 8,
            "title": "Fate/Kaleid Liner PRISMA☆ILLYA",
            "description": "Mage's Association members Rin Toosaka and Luviagelita 'Luvia' Edelfelt are tasked with finding and retrieving seven Class Cards, medieval artifacts containing the life essence of legendary Heroic Spirits. To aid them in their mission, they are granted the power of Ruby and Sapphire, two sentient Kaleidosticks that would enable them to transform themselves into magical girls and drastically increase their abilities. However, the two mages are on anything but good terms, prompting the Kaleidosticks to abandon them in search for new masters. They stumble upon two young schoolgirls—Illyasviel von Einzbern and Miyu—and quickly convince them to form a contract. With their new powers and responsibilities, Illya and Miyu set forth to collect all the Class Cards.",
            "thumb": "fate-kaleid.jpg",
            "video": "https://",
            "type": "series",
            "viewed": 4510,
            "totalEpisodes": 10,
            "releaseYear": "2013"
        },
        {
            "id": 9,
            "title": "Fate/Grand Order: First Order",
            "description": "In 2015, the Chaldea Security Organization draws on experts of both the magical and mundane fields to observe the future of mankind for possible extinction events. Humanity's survival seems assured for the next century—until the verdict suddenly changes, and now eradication of the species awaits at the end of 2016. The cause is unknown, but appears to be linked with the Japanese town of Fuyuki and the events of 2004 during the Fifth Holy Grail War.",
            "thumb": "fate-grand-order.jpg",
            "video": "https://",
            "type": "movie",
            "viewed": 9402,
            "totalEpisodes": 1,
            "releaseYear": "2016"
        }
    ],
    "total": 4
}
